backend-api/app/Controllers/Barang.php

    public function index()
    {
        return $this->respond(
            $this->model
                ->select('barang.*, kategori.nama_kategori')
                ->join('kategori', 'kategori.id = barang.kategori_id')
                ->findAll()
        );
---
SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`