backend-api/app/Controllers/BarangKeluar.php

SELECT `barang_keluar`.*, `barang`.`nama_barang`
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id` = `barang_keluar`.`barang_id`
---
    public function index()
    {
        return $this->respond(
            $this->model
                ->select('barang_keluar.*, barang.nama_barang')
                ->join('barang', 'barang.id = barang_keluar.barang_id')
                ->findAll()
        );