backend-api/app/Controllers/BarangMasuk.php

SELECT `barang_masuk`.*, `barang`.`nama_barang`
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id` = `barang_masuk`.`barang_id`
---
    public function index()
    {
        return $this->respond(
            $this->model
                ->select('barang_masuk.*, barang.nama_barang')
                ->join('barang', 'barang.id = barang_masuk.barang_id')
                ->findAll()
        );