backend-api/app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `token` = '8a3b6510e2bf9c2103968dcd342e583ea0cd5ea1f7ba2eb0e14b140f4f5b8fc0'
 LIMIT 1
---
    public function before(
        RequestInterface $request,
        $arguments = null
    )
    {
        $header = $request->getHeaderLine('Authorization');

        if (!$header) {
            return service('response')
                ->setStatusCode(401)
                ->setJSON([
                    'message' => 'Unauthorized'
                ]);
        }

        $token = str_replace(
            'Bearer ',
            '',
            $header
        );

        $userModel = new UserModel();

        $user = $userModel
            ->where('token', $token)
            ->first();